#include "Main.h"
#include "Game.h"
#include "Camera.h"

#define CAMERA_LENGTH	10.0f

//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Camera::Init()
{
	m_pos.set(0.0f, 20.0f, -30.0f);
	m_look.set(0.0f, 0.0f, 0.0f);
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Camera::Update(Float3& _pos, Float3& _rot)
{
	m_look.set(_pos);

	float cameraRot = _rot.y + 180.0f;
	m_pos.x = m_look.x + CAMERA_LENGTH * sinf((TO_RADIAN(cameraRot)));
	m_pos.z = m_look.z + CAMERA_LENGTH * cosf((TO_RADIAN(cameraRot)));
	m_pos.y = m_look.y + 5.0f;
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Camera::Render()
{
	SetCameraPositionAndTarget_UpVecY(VGet(m_pos.x, m_pos.y, m_pos.z), VGet(m_look.x, m_look.y, m_look.z));
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
