#include "Main.h"
#include "Game.h"
#include "Random.h"
#include "Npc.h"

//	移動スピード
#define NPC_MOV_SPEED	0.05f
//	回転スピード
#define NPC_ROT_SPEED	0.3f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Npc::Init( int model )
{
	m_model = model;

	m_pos.x = -5.0f;
	m_pos.z = 10.0f;
	m_rot.y = 90.0f;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Npc::Update()
{
	m_rot.y += NPC_ROT_SPEED;

	//	元ベクトルを作成
	Float3 base( 0.0f, 0.0f, NPC_MOV_SPEED );
	//	Ｙ軸回転行列を作成
	MATRIX mat = MGetRotY( TO_RADIAN( m_rot.y ) );
	//	元ベクトルをその行列で変換して移動ベクトル作成
	Float3 mov = VTransform( base.VGet(), mat );
	//	その移動ベクトルで座標移動
	m_pos += mov;
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Npc::Render()
{
	MV1SetPosition( m_model, VGet( m_pos.x, m_pos.y, m_pos.z ) );
	MV1SetRotationXYZ( m_model, VGet( TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) ) );
	MV1DrawModel( m_model );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Npc::Exit()
{
}
