#pragma once

#include "Float3.h"

//---------------------------------------------------------------------------------
//	カメラクラス
//---------------------------------------------------------------------------------
class Camera
{
public:
	//	カメラをどこに置くのか
	Float3		m_pos;
	//	そのカメラがどこを見るのか
	Float3		m_look;
	float m_rot;

	void Init();		//	初期化処理

	//	今回のカメラはプレイヤーの座標と向きが必要
	//	座標を向きを受け取るようにします
	void Update( Float3 &pos, Float3 &rot );		//	更新処理

	void Render();		//	描画処理
	void Exit();		//	終了処理
};
