#include "Main.h"
#include "Player.h"

//	プレイヤーの移動スピード
#define PLAYER_MOV_SPEED	0.1f
//	プレイヤーの回転スピード（度）
#define PLAYER_ROT_SPEED	1.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Player::Init( int model )
{
	//	渡されたモデルデータ番号を受け取る
	m_model = model;
	//	初期座標の設定
	m_pos.set( 0.0f, 0.0f, -5.0f );
	//	初期向きの設定（３軸の回転角度）
	m_rot.set( 0.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Player::Update()
{
	//	右キーを押しているとき
	if( CheckHitKey( KEY_INPUT_RIGHT ) ){
		//	Ｙ軸で回転（右回転：回転方向がプラス）
		m_rot.y += PLAYER_ROT_SPEED;
	}
	//	左キーを押しているとき
	if( CheckHitKey( KEY_INPUT_LEFT ) ){
		//	左回転させる
		m_rot.y -= PLAYER_ROT_SPEED;
	}

	//	上キーを押しているとき
	if( CheckHitKey( KEY_INPUT_UP ) ){
		//	向いている方向に移動する
		//	（ＸＺ平面上を移動するのでＸＺの座標移動）
		m_pos.x += PLAYER_MOV_SPEED * sinf( TO_RADIAN( m_rot.y ) );
		m_pos.z += PLAYER_MOV_SPEED * cosf( TO_RADIAN( m_rot.y ) );
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Player::Render()
{
	//	そのモデルの座標を設定
	MV1SetPosition( m_model, VGet( m_pos.x, m_pos.y, m_pos.z ) );
	//	そのモデルの向きを設定
	MV1SetRotationXYZ( m_model, VGet( TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) ) );
	//	そのモデルを描画
	MV1DrawModel( m_model );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Player::Exit()
{
}
