#include "Main.h"
#include "Game.h"
#include "Camera.h"
#include "Random.h"

//	カメラの回転スピード
#define CAMERA_ROT_SPEED	1.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Camera::Init()
{
	//	カメラ座標の初期設定
	m_pos.set( 0.0f, 13.0f, -20.0f );
	//	カメラの向き
	m_rot.set( 35.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Camera::Update()
{
	//	ＷＡＳＤキーでカメラの向き回転
	if( CheckHitKey( KEY_INPUT_D ) )	m_rot.y += CAMERA_ROT_SPEED;
	if( CheckHitKey( KEY_INPUT_A ) )	m_rot.y -= CAMERA_ROT_SPEED;
	if( CheckHitKey( KEY_INPUT_W ) )	m_rot.x -= CAMERA_ROT_SPEED;
	if( CheckHitKey( KEY_INPUT_S ) )	m_rot.x += CAMERA_ROT_SPEED;
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Camera::Render()
{
	//	座標と向きを渡してカメラの設定
	SetCameraPositionAndAngle( m_pos.VGet(), TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
