#include "Main.h"
#include "Game.h"
#include "Camera.h"
#include "Random.h"

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Camera::Init()
{
	//	カメラ座標
	m_pos.set( 0.0f, 5.0f, -10.0f );
	//	向き
	m_rot.set( 15.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Camera::Update( Float3 player_pos, Float3 player_rot )
{
	//	プレイヤーと同じ方向を向かせます
	m_rot.y = player_rot.y;

	//	カメラ座標はプレイヤーの後ろに
	Float3 base( 0.0f, 5.0f, -10.0f );
	MATRIX mat = MGetRotY( TO_RADIAN( m_rot.y ) );
	Float3 change = GetFloat3VTransform( base, mat );
	m_pos = player_pos + change;

	//	マウス右ドラッグしている時
	if( CheckMouseInput( MOUSE_INPUT_RIGHT ) ){
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Camera::Render()
{
	//	座標と向きを渡してカメラの設定
	SetCameraPositionAndAngle( m_pos.VGet(), TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
