#include "Main.h"
#include "Game.h"
#include "Camera.h"

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Camera::Init()
{
	//	カメラ座標（カメラをどこに置くのか）
	m_pos.set( 0.0f, 20.0f, -30.0f );
	//	見る座標
	m_look.set( 0.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Camera::Update( Float3 &player_pos, Float3 &npc_pos )
{
	//Look
	m_look = npc_pos;
	m_look.y += 1.0f;

	//Pos
	Float3 dir = m_pos - npc_pos;

	dir.y = 0;
	dir.SetLength(5.0f);

	m_pos = player_pos + dir;
	m_pos.y += 2.0f;
	
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Camera::Render()
{
	//	カメラ座標と見る座標を渡してカメラの設定
	SetCameraPositionAndTarget_UpVecY( VGet( m_pos.x, m_pos.y, m_pos.z ), VGet( m_look.x, m_look.y, m_look.z ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
