#include "Main.h"
#include "Game.h"
#include "Camera.h"
#include "Random.h"

//	カメラの回転スピード
#define CAMERA_ROT_SPEED	1.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Camera::Init()
{
	//	カメラ座標
	m_pos.set( 0.0f, 20.0f, -35.0f );
	//	カメラの向いている角度
	m_rot.set( 35.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Camera::Update()
{
	//	左右キーでカメラの横方向（Ｙ軸回転）の角度変更
	if( CheckHitKey( KEY_INPUT_RIGHT ) ){
		m_rot.y += CAMERA_ROT_SPEED;
	}
	if( CheckHitKey( KEY_INPUT_LEFT ) ){
		m_rot.y -= CAMERA_ROT_SPEED;
	}

	//	上下キーでカメラの縦方向（Ｘ軸回転）の角度変更
	if( CheckHitKey( KEY_INPUT_UP ) ){
		m_rot.x -= CAMERA_ROT_SPEED;
	}
	if( CheckHitKey( KEY_INPUT_DOWN ) ){
		m_rot.x += CAMERA_ROT_SPEED;
	}
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Camera::Render()
{
	//	カメラ座標と角度を渡してカメラ設定
	SetCameraPositionAndAngle( m_pos.VGet(), TO_RADIAN( m_rot.x ), TO_RADIAN( m_rot.y ), TO_RADIAN( m_rot.z ) );
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
