#include "Main.h"
#include "Game.h"
#include "Hit.h"
#include "Player.h"

#define PLAYER_MOV_SPEED	0.2f
#define PLAYER_ROT_SPEED	3.0f

//---------------------------------------------------------------------------------
//	初期化処理
//---------------------------------------------------------------------------------
void Player::Init(int model)
{
	m_model = model;

	m_pos.x = -5.0f;
	m_pos.z = -15.0f;
}
//---------------------------------------------------------------------------------
//	更新処理
//---------------------------------------------------------------------------------
void Player::Update()
{
	if (PushHitKey(KEY_INPUT_SPACE))
	{
		m_frame = 30;
		//	このプロジェクトでのプレイヤーは、十字キーでの向き変更や移動はありません
	}
	m_frame--;

	if (m_frame == 0)
	{
		m_mov.y = 0.3f;
	}

	m_pos += m_mov;

	m_mov.y -= 0.01f;
}
//---------------------------------------------------------------------------------
//	描画処理
//---------------------------------------------------------------------------------
void Player::Render()
{
	MV1SetPosition(m_model, VGet(m_pos.x, m_pos.y, m_pos.z));
	MV1SetRotationXYZ(m_model, VGet(TO_RADIAN(m_rot.x), TO_RADIAN(m_rot.y), TO_RADIAN(m_rot.z)));
	MV1DrawModel(m_model);
}
//---------------------------------------------------------------------------------
//	終了処理
//---------------------------------------------------------------------------------
void Player::Exit()
{
}
