#include "Main.h"
#include "Game.h"
#include "Camera.h"

#define CAMERA_LENGTH 15.0f
//---------------------------------------------------------------------------------
//	èâä˙âªèàóù
//---------------------------------------------------------------------------------
void Camera::Init()
{
	m_pos.set( 0.0f, 20.0f, -30.0f );
	m_look.set( 0.0f, 0.0f, 0.0f );
}
//---------------------------------------------------------------------------------
//	çXêVèàóù
//---------------------------------------------------------------------------------
void Camera::Update( Float3 &player_pos )
{
	//CameraArmRig
	m_look = player_pos;
	Float3 dir = m_pos - player_pos;
	dir.y = 0;
	dir.SetLength(CAMERA_LENGTH);
	m_pos = player_pos + dir;
	m_pos.y += 3;
}
//---------------------------------------------------------------------------------
//	ï`âÊèàóù
//---------------------------------------------------------------------------------
void Camera::Render()
{
	SetCameraPositionAndTarget_UpVecY( VGet( m_pos.x, m_pos.y, m_pos.z ), VGet( m_look.x, m_look.y, m_look.z ) );
}
//---------------------------------------------------------------------------------
//	èIóπèàóù
//---------------------------------------------------------------------------------
void Camera::Exit()
{
}
